docs/dqb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-26 Tue 11:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DynamicQueryBuilder</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Cem YILMAZ &lt;cmylmzbm@outlook.com&gt;" />
<link rel="stylesheet" type="text/css" href="rtdocstheme/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="rtdocstheme/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">DynamicQueryBuilder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org241a0c5">1. What?</a></li>
<li><a href="#orgcb3bce0">2. Why?</a></li>
<li><a href="#orga5c71eb">3. Installation</a></li>
<li><a href="#org6b8bf68">4. DynamicQueryOptions</a>
<ul>
<li><a href="#org566d845">4.1. Basic usage of DQB like below:</a></li>
</ul>
</li>
<li><a href="#org1ba0514">5. Filters</a>
<ul>
<li>
<ul>
<li><a href="#org3086f50">5.0.1. Filter Value Conversion</a></li>
<li><a href="#orga78f894">5.0.2. Supported Filters</a></li>
<li><a href="#org374482d">5.0.3. Supported Logical Operators</a></li>
<li><a href="#orgb592560">5.0.4. Filter Examples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org90ad051">6. Sorting</a>
<ul>
<li>
<ul>
<li><a href="#org1e5e223">6.0.1. Sorting Examples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfc1e829">7. Accessing Nested Objects</a></li>
<li><a href="#org668303c">8. Pagination</a>
<ul>
<li><a href="#org91a70ac">8.1. Pagination Examples:</a>
<ul>
<li><a href="#orga89ae04">8.1.1. How to access the filtered count of the query</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org36b2465">9. Web Development with DQB</a>
<ul>
<li><a href="#orgf40616f">9.1. Setting up DynamicQueryBuilderSettings</a></li>
<li><a href="#orge483dd2">9.2. Query Delivery Methods</a></li>
<li><a href="#org727586b">9.3. HTTP Parameters</a>
<ul>
<li><a href="#org6717bfc">9.3.1. <code>o</code> Parameter</a></li>
<li><a href="#org4beb4ff">9.3.2. <code>p</code> Parameter</a></li>
<li><a href="#org4ec9cb1">9.3.3. <code>v</code> Parameter</a></li>
<li><a href="#orgc444fb5">9.3.4. <code>s</code> Parameter</a></li>
<li><a href="#org8cb4caf">9.3.5. <code>offset</code> Parameter</a></li>
<li><a href="#org56ee646">9.3.6. <code>count</code> Parameter</a></li>
</ul>
</li>
<li><a href="#orgc6637a1">9.4. HTTP Query Examples</a></li>
<li><a href="#orge5e376a">9.5. Operation Shortcodes</a>
<ul>
<li><a href="#org1fb100e">9.5.1. Custom Operation Shortcodes</a></li>
</ul>
</li>
<li><a href="#orge784700">9.6. Web Action Examples</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org241a0c5" class="outline-2">
<h2 id="org241a0c5"><span class="section-number-2">1</span> What?</h2>
<div class="outline-text-2" id="text-1">
<p>
DynamicQueryBuilder(DQB) is a lightweight LINQ builder library that works dynamically with the given
collection generic type.
</p>
</div>
</div>

<div id="outline-container-orgcb3bce0" class="outline-2">
<h2 id="orgcb3bce0"><span class="section-number-2">2</span> Why?</h2>
<div class="outline-text-2" id="text-2">
<p>
The motivation behind DQB was to reverse the
development cost of operations such as Filtering, Sorting, Paginating data from
backend to clients. This allows client development to be more free and less
time consuming for non-fullstack development workspaces.
</p>
</div>
</div>

<div id="outline-container-orga5c71eb" class="outline-2">
<h2 id="orga5c71eb"><span class="section-number-2">3</span> Installation</h2>
<div class="outline-text-2" id="text-3">
<p>
You can get DQB from NuGet services with the command below or NuGet UI in visual
studio.
</p>

<p>
DQB currently runs with .netstandard2.1
</p>
<pre class="example">
Install-Package DynamicQueryBuilder
</pre>
</div>
</div>

<div id="outline-container-org6b8bf68" class="outline-2">
<h2 id="org6b8bf68"><span class="section-number-2">4</span> DynamicQueryOptions</h2>
<div class="outline-text-2" id="text-4">
<p>
This is the class that holds everything from filters to sorts and pagination 
options. DQB's has a function called <b><code>ApplyFilters</code></b> which converts
this <b><code>DynamicQueryOptions</code></b> class into a LINQ expression. You can check out
this object <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/DynamicQueryOptions.cs">here</a>.
</p>
</div>

<div id="outline-container-org566d845" class="outline-3">
<h3 id="org566d845"><span class="section-number-3">4.1</span> Basic usage of DQB like below:</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-csharp">IQueryable&lt;MyObject&gt; myCollection = GetMyCollectionOfData();
var myOpts = new DynamicQueryOptions
{
    /*
      Filters,
      SortingOptions,
      Pagination
    */
};

IQueryable&lt;MyObject&gt; dqbResults = myCollection.ApplyFilters(myOpts);
return dqbResults.ToList();
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ba0514" class="outline-2">
<h2 id="org1ba0514"><span class="section-number-2">5</span> Filters</h2>
<div class="outline-text-2" id="text-5">
<p>
Filters are the objects that hold your logical filters. You can see the object structure <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/Filter.cs">here</a>.
</p>
</div>

<div id="outline-container-org3086f50" class="outline-4">
<h4 id="org3086f50"><span class="section-number-4">5.0.1</span> Filter Value Conversion</h4>
<div class="outline-text-4" id="text-5-0-1">
<p>
Since DQB always boxes your data into an <code>object</code> the actual type conversion is
being handled by DQB while transforming your filters into a LINQ expression. DQB
also can handle <code>null</code> values as well.
</p>
</div>
</div>

<div id="outline-container-orga78f894" class="outline-4">
<h4 id="orga78f894"><span class="section-number-4">5.0.2</span> Supported Filters</h4>
<div class="outline-text-4" id="text-5-0-2">
<div class="org-src-container">
<pre class="src src-csharp">In,
Equals,
LessThan,
Contains,
NotEqual,
EndsWith,
StartsWith,
GreaterThan,
LessThanOrEqual,
GreaterThanOrEqual,
Any,
All
</pre>
</div>
</div>
</div>
<div id="outline-container-org374482d" class="outline-4">
<h4 id="org374482d"><span class="section-number-4">5.0.3</span> Supported Logical Operators</h4>
<div class="outline-text-4" id="text-5-0-3">
<p>
All logical operators are supported from Conditional to Bitwise. If you do not
define a logical operator to a <code>Filter</code>, DQB will choose <code>AndAlso</code> as default
Logical Operator.
</p>
</div>
</div>

<div id="outline-container-orgb592560" class="outline-4">
<h4 id="orgb592560"><span class="section-number-4">5.0.4</span> Filter Examples</h4>
<div class="outline-text-4" id="text-5-0-4">
<p>
An example usage of <code>Filter</code> class with a flat object:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var dqbOpts = new DynamicQueryOptions
{
    Filters = new List&lt;Filter&gt;()
    {
        new Filter
        {
            Value = "bar",
            PropertyName = "foo",
            Operator = FilterOperation.Equals
        }
    }
};

// LINQ Translation: myCollection.Where(x =&gt; x.foo == "bar");
</pre>
</div>

<p>
An example usage of <code>Filter</code> class with a collection property:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var dqbOpts = new DynamicQueryOptions
{
    Filters = new List&lt;Filter&gt;
    {
        new Filter
        {
            Value = new DynamicQueryOptions
            {
                Value = "some_value",
                Operator = FilterOperation.Equals,
                PropertyName = "bar"
            },
            Operator = FilterOperation.Any,
            PropertyName = "foo"
        }
    }
};

// LINQ Translation: myCollection.Where(x =&gt; x.foo.Any(y =&gt; y.bar == "some_value"));
</pre>
</div>


<p>
An example usage of <code>Filter</code> class with a logical operator, combining two filters:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var dqbOpts = new DynamicQueryOptions
{
    Filters = new List&lt;Filter&gt;
    {
        new Filter
        {
            Value = "123",
            PropertyName = "Fizz",
            Operator = FilterOperation.Equals,
            LogicalOperator = LogicalOperator.OrElse,
        },
        new Filter
        {
            Value = "321",
            PropertyName = "Fizz",
            Operator = FilterOperation.Equals,
        }
    }
};

// LINQ Translation: myCollection.Where(x =&gt; x.Fizz == "123" || x.Fizz == "321");
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org90ad051" class="outline-2">
<h2 id="org90ad051"><span class="section-number-2">6</span> Sorting</h2>
<div class="outline-text-2" id="text-6">
<p>
Sorting is extremely easy with DQB. DQB currently does not support for custom
sorting callbacks and uses default .NET's <code>OrderBy</code>, <code>OrderByDescending</code>,
<code>ThenBy</code> and <code>ThenByDescending</code> functions. Sorting should be provided via
<code>SortOption</code> class which you can check out <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/SortOption.cs">here</a>.
</p>
</div>

<div id="outline-container-org1e5e223" class="outline-4">
<h4 id="org1e5e223"><span class="section-number-4">6.0.1</span> Sorting Examples</h4>
<div class="outline-text-4" id="text-6-0-1">
<div class="org-src-container">
<pre class="src src-csharp">var dqbOpts = new DynamicQueryOptions
{
    SortOptions = new List&lt;SortOption&gt;()
    {
        new SortOption
        {
            SortingDirection = SortingDirection.Asc,
            PropertyName = "Foo"
        };

        new SortOption
        {
            SortingDirection = SortingDirection.Desc,
            PropertyName = "Bar"
        };
    }
};

// LINQ Translation: myCollection.OrderBy(x =&gt; x.Foo).ThenByDescending(x =&gt; x.Bar);
</pre>
</div>
</div>
</div>
</div>
