docs/dqb.org
* Accessing Nested Objects

DQB can access nested object with ~.~ delimeter like C# LINQ.
#+BEGIN_SRC csharp
public class MyNestedClass
{
    public int Age { get; set; }
}

public class MyClassToFilter
{
    public MyNestedClass MyNestedProperty { get; set; }
}
#+END_SRC

With the object structures above, we could utilize ~Filter~ and ~Sort~
operations like below:

- *Filter*
 #+BEGIN_SRC csharp
new Filter
{
    Value = "27",
    Operator = FilterOperation.Equals,
    PropertyName = "MyNestedProperty.Age"
};

// LINQ Translation: myCollection.Where(x => x.MyNestedProperty.Age == 28);
 #+END_SRC

- *Sort*
  #+BEGIN_SRC csharp
new SortOption
{
    SortingDirection = SortingDirection.Asc,
    PropertyName = "MyNestedProperty.Age"
}

// LINQ Translation: myCollection.OrderBy(x => x.MyNestedProperty.Age);
  #+END_SRC

* Pagination

Pagination can be done by specifiynig options into the ~PaginationOptions~
member of ~DynamicQueryOptions~ class. You can check it out [[https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/PaginationOption.cs][here]].
Pagination utilizes LINQ's ~Skip~ and ~Take~ functions.

** Pagination Examples:
#+BEGIN_SRC csharp
var paginationOption = new PaginationOption
{
    Count = 10,
    Offset = 0,
    AssignDataSetCount = true
};

// LINQ Translation: myCollection.Skip(0).Take(10);
#+END_SRC

*** How to access the filtered count of the query
if its required to access the total query result amount(whole set) you can access it via

#+BEGIN_SRC csharp
int totalDataSetCount = paginationOption.DataSetCount;
#+END_SRC

* Web Development with DQB
Web development is actually where DQB shines the most. DQB comes with an
~ActionFilter~ that can parse HTTP queries into ~DynamicQueryOptions~ class.

If you want change global config for ~ActionFilter~, this can be use ~DynamicQueryAttributeGlobalConfig~.

** Setting up DynamicQueryBuilderSettings
This is a singleton object that can hold static configurations for DQB like
operation shortcodes, query resolution methods and data source case sensitivity.
You can check out this object [[https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/DynamicQueryBuilderSettings.cs][here]].

It is usually best to create an instance of this class in your Web Projects
~Startup.cs~ and inject it as a singleton like below

#+BEGIN_SRC csharp
    public class Startup
    {
        public Startup(ILogger<Startup> logger, IConfiguration configuration)
        {
            this.Logger = logger;
            this.Configuration = configuration;
        }

        public ILogger<Startup> Logger { get; }

        public IConfiguration Configuration { get; }

        // This method gets called by the runtime. Use this method to add services to the container.
        public void ConfigureServices(IServiceCollection services)
        {
            // .. other stuff

            var dqbSettings = new DynamicQueryBuilderSettings
            {
                // .. your settings(explained below)
            };

            services.AddSingleton(dqbSettings);

            // .. other stuff
        }
    }
#+END_SRC

** Query Delivery Methods
DQB can retrieve your encoded/non-encoded queries via options like below:

- *Request QueryString*

Below, there is an example of configuring DQB to retrieve queries from query string

#+BEGIN_SRC csharp
string parameterToResolveFrom = "myparamtoresolve";
Func<string, string> decodeFunction = (encodedQuery) => magicDecode(encodedQuery);

new DynamicQueryBuilderSettings
{
    // Other configurations
    QueryOptionsResolver = new QueryStringResolver(parameterToResolveFrom, decodeFunction)
}
#+END_SRC

*Tip*: you can leave ~parameterToResolveFrom~ null to resolve your queries
directly from the raw querystring.

- *Request HTTP Header*
 
 Below, there is an example of configuring DQB to retrieve queries from HTTP Headers

#+BEGIN_SRC csharp
string httpHeaderName = "myhttpheadername";
Func<string, string> decodeFunction = (encodedQuery) => magicDecode(encodedQuery);

new DynamicQueryBuilderSettings
{
    // Other configurations
    QueryOptionsResolver = new HttpHeaderResolver(httpHeaderName, decodeFunction)
}
#+END_SRC

*Tip*: you can always leave ~decodeFunction~ null if your queries are not encoded.

** HTTP Parameters
*** ~o~ Parameter
 - Refers to ~FilterOperation~ and ~LogicalOperator~ properties of ~Filter~
   class.
 - Parameter formation should be ~FilterOperation|LogicalOperator~ using ~|~ as
   a delimeter between properties.
 - This parameter can be placed anywhere in the querystring.
 - This parameter **should be forming a triplet with ~p~ and ~v~ parameters.**

*** ~p~ Parameter
 - Refers to the ~PropertyName~ property of ~Filter~ class.
 - This parameter **should be placed after the ~o~ parameter.**.
 - This parameter **should be forming a triplet with ~o~ and ~v~ parameters.**

*** ~v~ Parameter
 - Refers to the ~PropertyValue~ property of ~Filter~ class.
 - This parameter **should be placed after the ~p~ parameter.**.
 - This parameter **should be forming a triplet with ~o~ and ~p~ parameters.**

*** ~s~ Parameter
 - Refers to the ~SortOption~ class.
 - This parameter can be placed anywhere in the querystring.
 - **If this parameter occurs more than once, sorting will be done in the given order.**

*** ~offset~ Parameter
 - Refers to the ~Offset~ property of ~PaginationOption~ class.
 - This parameter can be placed anywhere in the querystring.
 - **If this parameter occurs more than once, the first occurence will be assigned.**

*** ~count~ Parameter
 - Refers to the ~Count~ property of ~PaginationOption~ class.
 - This parameter can be placed anywhere in the querystring.
 - **If this parameter occurs more than once, the first occurence will be assigned.**
  
