docs/dqb.html

<div id="outline-container-orgfc1e829" class="outline-2">
<h2 id="orgfc1e829"><span class="section-number-2">7</span> Accessing Nested Objects</h2>
<div class="outline-text-2" id="text-7">
<p>
DQB can access nested object with <code>.</code> delimeter like C# LINQ.
</p>
<div class="org-src-container">
<pre class="src src-csharp">public class MyNestedClass
{
    public int Age { get; set; }
}

public class MyClassToFilter
{
    public MyNestedClass MyNestedProperty { get; set; }
}
</pre>
</div>

<p>
With the object structures above, we could utilize <code>Filter</code> and <code>Sort</code>
operations like below:
</p>

<ul class="org-ul">
<li><p>
<b>Filter</b>
</p>
<div class="org-src-container">
<pre class="src src-csharp">new Filter
{
    Value = "27",
    Operator = FilterOperation.Equals,
    PropertyName = "MyNestedProperty.Age"
};

// LINQ Translation: myCollection.Where(x =&gt; x.MyNestedProperty.Age == 28);
</pre>
</div></li>

<li><p>
<b>Sort</b>
</p>
<div class="org-src-container">
<pre class="src src-csharp">new SortOption
{
    SortingDirection = SortingDirection.Asc,
    PropertyName = "MyNestedProperty.Age"
}

// LINQ Translation: myCollection.OrderBy(x =&gt; x.MyNestedProperty.Age);
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org668303c" class="outline-2">
<h2 id="org668303c"><span class="section-number-2">8</span> Pagination</h2>
<div class="outline-text-2" id="text-8">
<p>
Pagination can be done by specifiynig options into the <code>PaginationOptions</code>
member of <code>DynamicQueryOptions</code> class. You can check it out <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/PaginationOption.cs">here</a>.
Pagination utilizes LINQ's <code>Skip</code> and <code>Take</code> functions.
</p>
</div>

<div id="outline-container-org91a70ac" class="outline-3">
<h3 id="org91a70ac"><span class="section-number-3">8.1</span> Pagination Examples:</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-csharp">var paginationOption = new PaginationOption
{
    Count = 10,
    Offset = 0,
    AssignDataSetCount = true
};

// LINQ Translation: myCollection.Skip(0).Take(10);
</pre>
</div>
</div>

<div id="outline-container-orga89ae04" class="outline-4">
<h4 id="orga89ae04"><span class="section-number-4">8.1.1</span> How to access the filtered count of the query</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
if its required to access the total query result amount(whole set) you can access it via
</p>

<div class="org-src-container">
<pre class="src src-csharp">int totalDataSetCount = paginationOption.DataSetCount;
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org36b2465" class="outline-2">
<h2 id="org36b2465"><span class="section-number-2">9</span> Web Development with DQB</h2>
<div class="outline-text-2" id="text-9">
<p>
Web development is actually where DQB shines the most. DQB comes with an
<code>ActionFilter</code> that can parse HTTP queries into <code>DynamicQueryOptions</code> class.
</p>
</div>

<div id="outline-container-orgf40616f" class="outline-3">
<h3 id="orgf40616f"><span class="section-number-3">9.1</span> Setting up DynamicQueryBuilderSettings</h3>
<div class="outline-text-3" id="text-9-1">
<p>
This is a singleton object that can hold static configurations for DQB like
operation shortcodes, query resolution methods and data source case sensitivity.
You can check out this object <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/DynamicQueryBuilderSettings.cs">here</a>.
</p>

<p>
It is usually best to create an instance of this class in your Web Projects
<code>Startup.cs</code> and inject it as a singleton like below
</p>

<div class="org-src-container">
<pre class="src src-csharp">public class Startup
{
    public Startup(ILogger&lt;Startup&gt; logger, IConfiguration configuration)
    {
        this.Logger = logger;
        this.Configuration = configuration;
    }

    public ILogger&lt;Startup&gt; Logger { get; }

    public IConfiguration Configuration { get; }

    // This method gets called by the runtime. Use this method to add services to the container.
    public void ConfigureServices(IServiceCollection services)
    {
        // .. other stuff

        var dqbSettings = new DynamicQueryBuilderSettings
        {
            // .. your settings(explained below)
        };

        services.AddSingleton(dqbSettings);

        // .. other stuff
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge483dd2" class="outline-3">
<h3 id="orge483dd2"><span class="section-number-3">9.2</span> Query Delivery Methods</h3>
<div class="outline-text-3" id="text-9-2">
<p>
DQB can retrieve your encoded/non-encoded queries via options like below:
</p>

<ul class="org-ul">
<li><b>Request QueryString</b></li>
</ul>

<p>
Below, there is an example of configuring DQB to retrieve queries from query string
</p>

<div class="org-src-container">
<pre class="src src-csharp">string parameterToResolveFrom = "myparamtoresolve";
Func&lt;string, string&gt; decodeFunction = (encodedQuery) =&gt; magicDecode(encodedQuery);

new DynamicQueryBuilderSettings
{
    // Other configurations
    QueryOptionsResolver = new QueryStringResolver(parameterToResolveFrom, decodeFunction)
}
</pre>
</div>

<p>
<b>Tip</b>: you can leave <code>parameterToResolveFrom</code> null to resolve your queries
directly from the raw querystring.
</p>

<ul class="org-ul">
<li><p>
<b>Request HTTP Header</b>
</p>

<p>
Below, there is an example of configuring DQB to retrieve queries from HTTP Headers
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-csharp">string httpHeaderName = "myhttpheadername";
Func&lt;string, string&gt; decodeFunction = (encodedQuery) =&gt; magicDecode(encodedQuery);

new DynamicQueryBuilderSettings
{
    // Other configurations
    QueryOptionsResolver = new HttpHeaderResolver(httpHeaderName, decodeFunction)
}
</pre>
</div>

<p>
<b>Tip</b>: you can always leave <code>decodeFunction</code> null if your queries are not encoded.
</p>
</div>
</div>

<div id="outline-container-org727586b" class="outline-3">
<h3 id="org727586b"><span class="section-number-3">9.3</span> HTTP Parameters</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org6717bfc" class="outline-4">
<h4 id="org6717bfc"><span class="section-number-4">9.3.1</span> <code>o</code> Parameter</h4>
<div class="outline-text-4" id="text-9-3-1">
<ul class="org-ul">
<li>Refers to <code>FilterOperation</code> and <code>LogicalOperator</code> properties of <code>Filter</code>
class.</li>
<li>Parameter formation should be <code>FilterOperation|LogicalOperator</code> using <code>|</code> as
a delimeter between properties.</li>
<li>This parameter can be placed anywhere in the querystring.</li>
<li>This parameter <b><b>should be forming a triplet with <code>p</code> and <code>v</code> parameters.</b></b></li>
</ul>
</div>
</div>

<div id="outline-container-org4beb4ff" class="outline-4">
<h4 id="org4beb4ff"><span class="section-number-4">9.3.2</span> <code>p</code> Parameter</h4>
<div class="outline-text-4" id="text-9-3-2">
<ul class="org-ul">
<li>Refers to the <code>PropertyName</code> property of <code>Filter</code> class.</li>
<li>This parameter <b><b>should be placed after the <code>o</code> parameter.</b></b>.</li>
<li>This parameter <b><b>should be forming a triplet with <code>o</code> and <code>v</code> parameters.</b></b></li>
</ul>
</div>
</div>

<div id="outline-container-org4ec9cb1" class="outline-4">
<h4 id="org4ec9cb1"><span class="section-number-4">9.3.3</span> <code>v</code> Parameter</h4>
<div class="outline-text-4" id="text-9-3-3">
<ul class="org-ul">
<li>Refers to the <code>PropertyValue</code> property of <code>Filter</code> class.</li>
<li>This parameter <b><b>should be placed after the <code>p</code> parameter.</b></b>.</li>
<li>This parameter <b><b>should be forming a triplet with <code>o</code> and <code>p</code> parameters.</b></b></li>
</ul>
</div>
</div>

<div id="outline-container-orgc444fb5" class="outline-4">
<h4 id="orgc444fb5"><span class="section-number-4">9.3.4</span> <code>s</code> Parameter</h4>
<div class="outline-text-4" id="text-9-3-4">
<ul class="org-ul">
<li>Refers to the <code>SortOption</code> class.</li>
<li>This parameter can be placed anywhere in the querystring.</li>
<li><b><b>If this parameter occurs more than once, sorting will be done in the given order.</b></b></li>
</ul>
</div>
</div>

<div id="outline-container-org8cb4caf" class="outline-4">
<h4 id="org8cb4caf"><span class="section-number-4">9.3.5</span> <code>offset</code> Parameter</h4>
<div class="outline-text-4" id="text-9-3-5">
<ul class="org-ul">
<li>Refers to the <code>Offset</code> property of <code>PaginationOption</code> class.</li>
<li>This parameter can be placed anywhere in the querystring.</li>
<li><b><b>If this parameter occurs more than once, the first occurence will be assigned.</b></b></li>
</ul>
</div>
</div>

<div id="outline-container-org56ee646" class="outline-4">
<h4 id="org56ee646"><span class="section-number-4">9.3.6</span> <code>count</code> Parameter</h4>
<div class="outline-text-4" id="text-9-3-6">
<ul class="org-ul">
<li>Refers to the <code>Count</code> property of <code>PaginationOption</code> class.</li>
<li>This parameter can be placed anywhere in the querystring.</li>
<li><b><b>If this parameter occurs more than once, the first occurence will be assigned.</b></b></li>
</ul>
</div>
</div>
</div>
