docs/dqb.html

<div id="outline-container-orgc6637a1" class="outline-3">
<h3 id="orgc6637a1"><span class="section-number-3">9.4</span> HTTP Query Examples</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li>Valid Example: <b>?o=Equals&amp;p=foo&amp;v=bar</b></li>
</ul>

<p>
will be transformed into:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var filter = new Filter
{
    Operator = FilterOperation.Equals,
    PropertyName = "foo",
    Value = "bar"
};

// LINQ Translation: myCollection.Where(x =&gt; x.foo == "bar");
</pre>
</div>

<p>
or to apply multiple filters
</p>

<ul class="org-ul">
<li>Valid Example: <b>?o=Equals&amp;p=foo&amp;v=bar&amp;o=Equals&amp;p=fizz&amp;v=buzz</b>
Since this query does not provide a logical operator, parser will choose
<code>AndAlso</code> which is the default logical operator.</li>
</ul>

<p>
will be transformed into:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var filterOne = new Filter
{
    Operator = FilterOperation.Equals,
    PropertyName = "foo",
    Value = "bar"
};

var filterTwo = new Filter
{
    Operator = FilterOperation.Equals,
    PropertyName = "fizz",
    Value = "buzz"
};

// LINQ Translation: myCollection.Where(x =&gt; x.foo == "bar" &amp;&amp; x.fizz == "buzz");
</pre>
</div>

<ul class="org-ul">
<li>Valid Example: <b>?o=Equals|OrElse&amp;p=foo&amp;v=bar&amp;o=Equals&amp;p=fizz&amp;v=buzz</b></li>
</ul>

<p>
will be transformed into:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var filterOne = new Filter
{
    LogicalOperator = LogicalOperation.OrElse,
    Operator = FilterOperation.Equals,
    PropertyName = "foo",
    Value = "bar"
};

var filterTwo = new Filter
{
    Operator = FilterOperation.Equals,
    PropertyName = "fizz",
    Value = "buzz"
};

// LINQ Translation: myCollection.Where(x =&gt; x.foo == "bar" || x.fizz == "buzz");
</pre>
</div>

<ul class="org-ul">
<li>Valid Example with ascending sort and pagination: <b>?o=Equals&amp;p=foo&amp;v=bar&amp;s=foo,asc&amp;offset=0&amp;count=10</b></li>
</ul>
<p>
<b>DynamicQueryOptions</b> Transform:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var filter = new Filter
{
    Operator = FilterOperation.Equals,
    PropertyName = "foo",
    Value = "bar"
};

var sort = new SortOption
{
    PropertyName = "foo",
    SortingDirection = SortingDirection.Asc
};

var pagination = new PaginationOption
{
    Offset = 0,
    Count = 10
};

/* LINQ Translation:

myCollection.Where(x =&gt; x.foo == "bar")
            .OrderBy(ord =&gt; ord.foo)
            .Skip(0)
            .Take(10);

*/
</pre>
</div>

<ul class="org-ul">
<li>Valid Example of Collection Member Querying <b>?o=any&amp;p=foo&amp;v=(o=Equals&amp;p=fizz&amp;v=buzz)</b></li>
</ul>
<p>
will be transformed into:
</p>

<div class="org-src-container">
<pre class="src src-csharp">var filter = new Filter
{
    Operator = FilterOperation.Any,
    PropertyName = "foo",
    Value = new DynamicQueryOptions
    {
        Operator = FilterOperation.Equals,
        PropertyName = "fizz",
        Value = "buzz"
    }
};

// LINQ Translation: myCollection.Where(x =&gt; x.foo.Any(y =&gt; y.fizz == "buzz"));
</pre>
</div>

<ul class="org-ul">
<li>Valid Example with pagination: <b>?offset=0&amp;count=10</b></li>

<li>Valid Example with descending sort: <b>?o=Equals&amp;p=foo&amp;v=bar&amp;s=foo,desc</b></li>

<li>Valid Descending Sort Example without any filters: <b>?s=foo,desc</b></li>
</ul>

<p>
<b>Tip</b>: if you do not provide any sorting direction, DynamicQueryBuilder will sort the data in <b>ascending</b> order.
</p>

<ul class="org-ul">
<li>Valid Example with ascending sort without stating the direction: <b>?o=Equals&amp;p=foo&amp;v=bar&amp;s=foo</b></li>
</ul>
</div>
</div>

<div id="outline-container-orge5e376a" class="outline-3">
<h3 id="orge5e376a"><span class="section-number-3">9.5</span> Operation Shortcodes</h3>
<div class="outline-text-3" id="text-9-5">
<p>
DQB has default operation short codes for shorter HTTP queries which are below;
</p>

<div class="org-src-container">
<pre class="src src-csharp">{ "eq", FilterOperation.Equals },
{ "lt", FilterOperation.LessThan },
{ "cts", FilterOperation.Contains },
{ "ne", FilterOperation.NotEqual },
{ "ew", FilterOperation.EndsWith },
{ "sw", FilterOperation.StartsWith },
{ "gt", FilterOperation.GreaterThan },
{ "ltoe", FilterOperation.LessThanOrEqual },
{ "gtoe", FilterOperation.GreaterThanOrEqual }
{ "any", FilterOperation.Any }
{ "all", FilterOperation.All }
</pre>
</div>
</div>

<div id="outline-container-org1fb100e" class="outline-4">
<h4 id="org1fb100e"><span class="section-number-4">9.5.1</span> Custom Operation Shortcodes</h4>
<div class="outline-text-4" id="text-9-5-1">
<p>
You can change any operation shortcode to whatever you want in
<code>DynamicQueryBuilderSettings</code> object's <code>CustomOpCodes</code> member like below.
</p>

<div class="org-src-container">
<pre class="src src-csharp">var mySettings = new DynamicQueryBuilderSettings
{
    CustomOpCodes = new CustomOpCodes
    {
        { "my_eq", FilterOperation.Equals },
        { "my_lt", FilterOperation.LessThan },
        { "my_cts", FilterOperation.Contains },
        { "my_ne", FilterOperation.NotEqual },
        { "my_ew", FilterOperation.EndsWith },
        { "my_sw", FilterOperation.StartsWith },
        { "my_gt", FilterOperation.GreaterThan },
        { "my_ltoe", FilterOperation.LessThanOrEqual },
        { "my_gtoe", FilterOperation.GreaterThanOrEqual },
        { "my_any", FilterOperation.Any },
        { "my_all", FilterOperation.All },
    }
};
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge784700" class="outline-3">
<h3 id="orge784700"><span class="section-number-3">9.6</span> Web Action Examples</h3>
<div class="outline-text-3" id="text-9-6">
<p>
<b>DynamicQueryAttribute</b> is the handler for parsing the querystring into <b>DynamicQueryOptions</b> class and has 3 optional parameters.
</p>

<div class="org-src-container">
<pre class="src src-csharp">DynamicQueryAttribute(
    // Declares the max page result count for the endpoint.
int maxCountSize = 100,
    // Declares the switch for inclusion of total data set count to *PaginationOptions* class.
bool includeDataSetCountToPagination = true,
    // Declares the behaviour when the requested page size exceeds the assigned maximum count.
PaginationBehaviour exceededPaginationCountBehaviour = PaginationBehaviour.GetMax,
    // Resolves the dynamic query string from the given query parameter value.
string resolveFromParameter = "")
</pre>
</div>

<ul class="org-ul">
<li><p>
The ResolveFromParameter
</p>

<p>
This argument exists because some API's would want to send their queries
inside of a HTTP parameter like below:
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-HTTP">https://foobar.com/results?dqb=%3Fo%3Deq%26p%3Dfoo%26v%3Dbar
</pre>
</div>

<p>
So, you can set this parameter specifically for an endpoint with the
<code>DynamicQueryAttribute</code> or you can set it in <code>DynamicQueryBuilderSettings</code>
globally with QueryResolvers. Check out <a href="#orge483dd2">Query Delivery Methods</a>.
</p>

<ul class="org-ul">
<li>PaginationBehaviour enum</li>
</ul>

<div class="org-src-container">
<pre class="src src-csharp">public enum PaginationBehaviour
{
    // DynamicQueryBuilder will return maxCountSize of results if the *Count* property exceeds *maxCountSize*.
    GetMax,
    // DynamicQueryBuilder will throw MaximumResultSetExceededException if the *Count* property exceeds *maxCountSize*.
    Throw
}
</pre>
</div>

<ul class="org-ul">
<li>Example with no pagination specified(default pagination options will be applied).</li>
</ul>

<div class="org-src-container">
<pre class="src src-csharp">[DynamicQuery]
[HttpGet("getMyDataSet")]
public IActionResult Get(DynamicQueryOptions filter)
{
    IEnumerable&lt;MyObject&gt; myDataSet = _myRepository.GetMyObjectList();
    return Ok(myDataSet.ApplyFilters(filter));
}
</pre>
</div>

<ul class="org-ul">
<li>Example with default pagination options for the endpoint specified.</li>
</ul>

<div class="org-src-container">
<pre class="src src-csharp">[HttpGet("getMyDataSet")]
[DynamicQuery(maxCountSize: 101, includeDataSetCountToPagination: true, exceededPaginationCountBehaviour: PaginationBehaviour.GetMax)]
public IActionResult Get(DynamicQueryOptions filter)
{
    IEnumerable&lt;MyObject&gt; myDataSet = _myRepository.GetMyObjectList();
    return Ok(myDataSet.ApplyFilters(filter));
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cem YILMAZ &lt;cmylmzbm@outlook.com&gt;</p>
<p class="date">Created: 2021-01-26 Tue 11:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
